# IsPespective Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..IsPespective Property
CameraInfo Class See Also
---
Identifies whether the projection is orthographic or perspective
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsPespective { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPespective As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPespective {
	bool get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace